In [1]:
import numpy as np
import pandas as pd

In [2]:
imdb_movies = pd.read_csv(r"IMDb movies.csv" , low_memory=False)

In [3]:
imdb_movies.head()

,imdb_title_id,title,original_title,year,date_published,genre,duration,country,language,director,...,actors,description,avg_vote,votes,budget,usa_gross_income,worlwide_gross_income,metascore,reviews_from_users,reviews_from_critics
0,tt0000009,Miss Jerry,Miss Jerry,1894,1894-10-09,Romance,45,USA,None,Alexander Black,...,"Blanche Bayliss, William Courtenay, Chauncey D...",The adventures of a female reporter in the 1890s.,5.9,154,NaN,NaN,NaN,NaN,1.0,2.0
1,tt0000574,The Story of the Kelly Gang,The Story of the Kelly Gang,1906,1906-12-26,"Biography, Crime, Drama",70,Australia,None,Charles Tait,...,"Elizabeth Tait, John Tait, Norman Campbell, Be...",True story of notorious Australian outlaw Ned ...,6.1,589,$ 2250,NaN,NaN,NaN,7.0,7.0
2,tt0001892,Den sorte drøm,Den sorte drøm,1911,1911-08-19,Drama,53,"Germany, Denmark",NaN,Urban Gad,...,"Asta Nielsen, Valdemar Psilander, Gunnar Helse...",Two men of high rank are both wooing the beaut...,5.8,188,NaN,NaN,NaN,NaN,5.0,2.0
3,tt0002101,Cleopatra,Cleopatra,1912,1912-11-13,"Drama, History",100,USA,English,Charles L. Gaskill,...,"Helen Gardner, Pearl Sindelar, Miss Fielding, ...",The fabled queen of Egypt's affair with Roman ...,5.2,446,$ 45000,NaN,NaN,NaN,25.0,3.0
4,tt0002130,L'Inferno,L'Inferno,1911,1911-03-06,"Adventure, Drama, Fantasy",68,Italy,Italian,"Francesco Bertolini, Adolfo Padovan",...,"Salvatore Papa, Arturo Pirovano, Giuseppe de L...",Loosely adapted from Dante's Divine Comedy and...,7.0,2237,NaN,NaN,NaN,NaN,31.0,14.0

# Languages Column
1. Dataframe with movie_id and language from imdb_movie -> movie_language (new df)
2. In movie_language, look ate the language column and split (','), put in variable 's' and line up with movie_genre indexes
3. Del the 'genre' column in movie_genre
4. Join 's' + movie_genre
5. Create languages table<br/>
   5.1. Dataframe with langiages name from movie_language -> languages (new df)<br/>
   5.2  Drop duplicates<br/>
   5.3  Ad de ID column<br/>
6. Merge movie_language with languages
7. Rename columns
8. Drop language column in movie_language to have a  table with the movie_id and language_id
9. Drop language column in imdb_movies

In [7]:
movie_language = imdb_movies[['imdb_title_id','language']] #Dataframe with movie_id and language column

In [10]:
movie_language

      imdb_title_id       language
0         tt0000009           None
1         tt0000574           None
2         tt0001892            NaN
3         tt0002101        English
4         tt0002130        Italian
...             ...            ...
85850     tt9908390         French
85851     tt9911196  German, Dutch
85852     tt9911774      Malayalam
85853     tt9914286        Turkish
85854     tt9914942        Catalan

[85855 rows x 2 columns]

In [11]:
s = movie_language['language'].str.split(',').apply(pd.Series, 1).stack() #split languages 
s.index = s.index.droplevel(-1)
s.name = 'language'
s

0             None
1             None
3          English
4          Italian
5          English
           ...
85851       German
85851        Dutch
85852    Malayalam
85853      Turkish
85854      Catalan
Name: language, Length: 109221, dtype: object

In [12]:
#del movie_language['language'] #run only once

In [16]:
#movie_language = movie_language.join(s)
movie_language.head()

  imdb_title_id language
0     tt0000009     None
1     tt0000574     None
2     tt0001892      NaN
3     tt0002101  English
4     tt0002130  Italian

In [17]:
languages = movie_language[['language']]

In [19]:
languages = languages.dropna()

In [21]:
languages = languages.drop_duplicates()

In [22]:
languages

            language
0               None
3            English
4            Italian
6             German
10            Danish
...              ...
82070       Balinese
82329         Tswana
84353        Soninke
84913          Haida
85467  Crimean Tatar

[421 rows x 1 columns]

In [24]:
languages.index = [x for x in range(1, len(languages.values)+1)] #redo the index

In [26]:
languages.index.name = 'Id' #rename
languages = languages.reset_index() #run only once
languages

      Id       language
0      1           None
1      2        English
2      3        Italian
3      4         German
4      5         Danish
..   ...            ...
416  417       Balinese
417  418         Tswana
418  419        Soninke
419  420          Haida
420  421  Crimean Tatar

[421 rows x 2 columns]

In [118]:
languages = languages.rename(columns = {'language': 'name'})

In [119]:
languages

      Id           name
0      1           None
1      2        English
2      3        Italian
3      4         German
4      5         Danish
..   ...            ...
416  417       Balinese
417  418         Tswana
418  419        Soninke
419  420          Haida
420  421  Crimean Tatar

[421 rows x 2 columns]

In [27]:
movie_language = pd.merge(movie_language, languages, how="left", on="language")

In [29]:
movie_language = movie_language.dropna()

In [31]:
movie_language.index = [x for x in range(1, len(movie_language.values)+1)]

In [33]:
movie_language = movie_language.rename(columns = {'imdb_title_id': 'movie_id', 'Id': 'language_id'})

In [35]:
del movie_language['language']

In [36]:
movie_language

         movie_id  language_id
1       tt0000009          1.0
2       tt0000574          1.0
3       tt0002101          2.0
4       tt0002130          3.0
5       tt0002199          2.0
...           ...          ...
109217  tt9911196          4.0
109218  tt9911196         68.0
109219  tt9911774        138.0
109220  tt9914286         53.0
109221  tt9914942        235.0

[109221 rows x 2 columns]

In [37]:
del imdb_movies['language']

In [38]:
imdb_movies

,imdb_title_id,title,original_title,year,date_published,genre,duration,country,director,writer,...,actors,description,avg_vote,votes,budget,usa_gross_income,worlwide_gross_income,metascore,reviews_from_users,reviews_from_critics
0,tt0000009,Miss Jerry,Miss Jerry,1894,1894-10-09,Romance,45,USA,Alexander Black,Alexander Black,...,"Blanche Bayliss, William Courtenay, Chauncey D...",The adventures of a female reporter in the 1890s.,5.9,154,NaN,NaN,NaN,NaN,1.0,2.0
1,tt0000574,The Story of the Kelly Gang,The Story of the Kelly Gang,1906,1906-12-26,"Biography, Crime, Drama",70,Australia,Charles Tait,Charles Tait,...,"Elizabeth Tait, John Tait, Norman Campbell, Be...",True story of notorious Australian outlaw Ned ...,6.1,589,$ 2250,NaN,NaN,NaN,7.0,7.0
2,tt0001892,Den sorte drøm,Den sorte drøm,1911,1911-08-19,Drama,53,"Germany, Denmark",Urban Gad,"Urban Gad, Gebhard Schätzler-Perasini",...,"Asta Nielsen, Valdemar Psilander, Gunnar Helse...",Two men of high rank are both wooing the beaut...,5.8,188,NaN,NaN,NaN,NaN,5.0,2.0
3,tt0002101,Cleopatra,Cleopatra,1912,1912-11-13,"Drama, History",100,USA,Charles L. Gaskill,Victorien Sardou,...,"Helen Gardner, Pearl Sindelar, Miss Fielding, ...",The fabled queen of Egypt's affair with Roman ...,5.2,446,$ 45000,NaN,NaN,NaN,25.0,3.0
4,tt0002130,L'Inferno,L'Inferno,1911,1911-03-06,"Adventure, Drama, Fantasy",68,Italy,"Francesco Bertolini, Adolfo Padovan",Dante Alighieri,...,"Salvatore Papa, Arturo Pirovano, Giuseppe de L...",Loosely adapted from Dante's Divine Comedy and...,7.0,2237,NaN,NaN,NaN,NaN,31.0,14.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
85850,tt9908390,Le lion,Le lion,2020,2020-01-29,Comedy,95,"France, Belgium",Ludovic Colbeau-Justin,"Alexandre Coquelle, Matthieu Le Naour",...,"Dany Boon, Philippe Katerine, Anne Serra, Samu...",A psychiatric hospital patient pretends to be ...,5.3,398,NaN,NaN,$ 3507171,NaN,NaN,4.0
85851,tt9911196,De Beentjes van Sint-Hildegard,De Beentjes van Sint-Hildegard,2020,2020-02-13,"Comedy, Drama",103,Netherlands,Johan Nijenhuis,"Radek Bajgar, Herman Finkers",...,"Herman Finkers, Johanna ter Steege, Leonie ter...",A middle-aged veterinary surgeon believes his ...,7.7,724,NaN,NaN,$ 7299062,NaN,6.0,4.0
85852,tt9911774,Padmavyuhathile Abhimanyu,Padmavyuhathile Abhimanyu,2019,2019-03-08,Drama,130,India,Vineesh Aaradya,"Vineesh Aaradya, Vineesh Aaradya",...,"Anoop Chandran, Indrans, Sona Nair, Simon Brit...",NaN,7.9,265,NaN,NaN,NaN,NaN,NaN,NaN
85853,tt9914286,Sokagin Çocuklari,Sokagin Çocuklari,2019,2019-03-15,"Drama, Family",98,Turkey,Ahmet Faik Akinci,"Ahmet Faik Akinci, Kasim Uçkan",...,"Ahmet Faik Akinci, Belma Mamati, Metin Keçeci,...",NaN,6.4,194,NaN,NaN,$ 2833,NaN,NaN,NaN
85854,tt9914942,La vida sense la Sara Amat,La vida sense la Sara Amat,2019,2020-02-05,Drama,74,Spain,Laura Jou,"Coral Cruz, Pep Puig",...,"Maria Morera Colomer, Biel Rossell Pelfort, Is...","Pep, a 13-year-old boy, is in love with a girl...",6.7,102,NaN,NaN,$ 59794,NaN,NaN,2.0

# Genres Column
1. Dataframe with movie_id and genre from imdb_movie -> movie_genre (new df)
2. In movie_genre, look ate the genre column and split (','), put in variable 's' and line up with movie_genre indexes
3. Del the 'genre' column in movie_genre
4. Join 's' + movie_genre
5. Create genres table<br/>
   5.1. Dataframe with genres_name from movie_genre -> genres (new df)<br/>
   5.2  Drop duplicates<br/>
   5.3  Ad de ID column<br/>
6. Merge movie_genre with genres
7. Rename columns
8. Drop genre column in movie_genre to have a  table with the movie_id and genre_id
9. Drop genre column in imdb_movies

In [39]:
imdb_movies.columns

Index(['imdb_title_id', 'title', 'original_title', 'year', 'date_published',
       'genre', 'duration', 'country', 'director', 'writer',
       'production_company', 'actors', 'description', 'avg_vote', 'votes',
       'budget', 'usa_gross_income', 'worlwide_gross_income', 'metascore',
       'reviews_from_users', 'reviews_from_critics'],
      dtype='object')

In [40]:
movie_genre = imdb_movies[['imdb_title_id', 'genre']]

In [42]:
movie_genre

      imdb_title_id                      genre
0         tt0000009                    Romance
1         tt0000574    Biography, Crime, Drama
2         tt0001892                      Drama
3         tt0002101             Drama, History
4         tt0002130  Adventure, Drama, Fantasy
...             ...                        ...
85850     tt9908390                     Comedy
85851     tt9911196              Comedy, Drama
85852     tt9911774                      Drama
85853     tt9914286              Drama, Family
85854     tt9914942                      Drama

[85855 rows x 2 columns]

In [44]:
s = movie_genre['genre'].str.split(',').apply(pd.Series, 1).stack()
s.index = s.index.droplevel(-1)
s.name = 'genre'
s

0          Romance
1        Biography
1            Crime
1            Drama
2            Drama
           ...
85851        Drama
85852        Drama
85853        Drama
85853       Family
85854        Drama
Name: language, Length: 175867, dtype: object

In [45]:
#Only run once to avoid errors
del movie_genre['genre']

In [46]:
movie_genre = movie_genre.join(s)

In [68]:
genres = movie_genre[['genre']]
genres = genres.drop_duplicates(subset=['genre'])
genres.index = [x for x in range(1, len(genres.values)+1)]
genres = genres.drop_duplicates(subset='genre', keep="last")
genres

          genre
1       Romance
2     Biography
3         Crime
4         Drama
5         Drama
6       History
7     Adventure
8       Fantasy
9       Romance
10      History
11          War
12        Crime
13      Mystery
14       Horror
15      Western
16      Fantasy
17       Comedy
18       Horror
19       Family
20    Adventure
21       Family
22       Action
23       Sci-Fi
24       Comedy
25      Western
26      Mystery
27     Thriller
28        Sport
29       Sci-Fi
30    Animation
31      Musical
32       Action
33        Music
34     Thriller
35    Film-Noir
36      Musical
37        Music
38    Biography
39          War
40    Film-Noir
41    Animation
42        Sport
43        Adult
44  Documentary
45   Reality-TV
46         News

In [90]:
genres = genres.drop_duplicates()
#genres
#genres = genres[['genre']] = genres[['genre']].astype(str)
#genres.dtypes
#print(genres.loc[genres['genre'] == ' Drama'])
genres['genre']  = genres['genre'].str.strip() #eleminate de white spaces

In [94]:
genres.index = [x for x in range(1, len(genres.values)+1)] #redo indexes

In [96]:
genres.index.name = 'Id' #rename
genres = genres.reset_index() #run only once

In [116]:
genres = genres.rename(columns = {'genre': 'name'})

In [117]:
genres

    Id         name
0    1      Romance
1    2    Biography
2    3        Crime
3    4        Drama
4    5      History
5    6    Adventure
6    7      Fantasy
7    8          War
8    9      Mystery
9   10       Horror
10  11      Western
11  12       Comedy
12  13       Family
13  14       Action
14  15       Sci-Fi
15  16     Thriller
16  17        Sport
17  18    Animation
18  19      Musical
19  20        Music
20  21    Film-Noir
21  22        Adult
22  23  Documentary
23  24   Reality-TV
24  25         News

In [104]:
movie_genre = pd.merge(movie_genre, genres, how="left", on="genre")

In [106]:
movie_genre = movie_genre.dropna()

In [108]:
movie_genre.index = [x for x in range(1, len(movie_genre.values)+1)]

In [110]:
movie_genre = movie_genre.rename(columns = {'imdb_title_id': 'movie_id', 'Id' : 'genre_id'})

In [112]:
del movie_genre['genre'] # run only once

In [113]:
movie_genre

        movie_id  genre_id
1      tt0000009       1.0
2      tt0000574       2.0
3      tt0001892       4.0
4      tt0002101       4.0
5      tt0002130       6.0
...          ...       ...
85851  tt9908390      12.0
85852  tt9911196      12.0
85853  tt9911774       4.0
85854  tt9914286       4.0
85855  tt9914942       4.0

[85855 rows x 2 columns]

In [114]:
del imdb_movies['genre'] #run only  once

In [115]:
imdb_movies

,imdb_title_id,title,original_title,year,date_published,duration,country,director,writer,production_company,actors,description,avg_vote,votes,budget,usa_gross_income,worlwide_gross_income,metascore,reviews_from_users,reviews_from_critics
0,tt0000009,Miss Jerry,Miss Jerry,1894,1894-10-09,45,USA,Alexander Black,Alexander Black,Alexander Black Photoplays,"Blanche Bayliss, William Courtenay, Chauncey D...",The adventures of a female reporter in the 1890s.,5.9,154,NaN,NaN,NaN,NaN,1.0,2.0
1,tt0000574,The Story of the Kelly Gang,The Story of the Kelly Gang,1906,1906-12-26,70,Australia,Charles Tait,Charles Tait,J. and N. Tait,"Elizabeth Tait, John Tait, Norman Campbell, Be...",True story of notorious Australian outlaw Ned ...,6.1,589,$ 2250,NaN,NaN,NaN,7.0,7.0
2,tt0001892,Den sorte drøm,Den sorte drøm,1911,1911-08-19,53,"Germany, Denmark",Urban Gad,"Urban Gad, Gebhard Schätzler-Perasini",Fotorama,"Asta Nielsen, Valdemar Psilander, Gunnar Helse...",Two men of high rank are both wooing the beaut...,5.8,188,NaN,NaN,NaN,NaN,5.0,2.0
3,tt0002101,Cleopatra,Cleopatra,1912,1912-11-13,100,USA,Charles L. Gaskill,Victorien Sardou,Helen Gardner Picture Players,"Helen Gardner, Pearl Sindelar, Miss Fielding, ...",The fabled queen of Egypt's affair with Roman ...,5.2,446,$ 45000,NaN,NaN,NaN,25.0,3.0
4,tt0002130,L'Inferno,L'Inferno,1911,1911-03-06,68,Italy,"Francesco Bertolini, Adolfo Padovan",Dante Alighieri,Milano Film,"Salvatore Papa, Arturo Pirovano, Giuseppe de L...",Loosely adapted from Dante's Divine Comedy and...,7.0,2237,NaN,NaN,NaN,NaN,31.0,14.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
85850,tt9908390,Le lion,Le lion,2020,2020-01-29,95,"France, Belgium",Ludovic Colbeau-Justin,"Alexandre Coquelle, Matthieu Le Naour",Monkey Pack Films,"Dany Boon, Philippe Katerine, Anne Serra, Samu...",A psychiatric hospital patient pretends to be ...,5.3,398,NaN,NaN,$ 3507171,NaN,NaN,4.0
85851,tt9911196,De Beentjes van Sint-Hildegard,De Beentjes van Sint-Hildegard,2020,2020-02-13,103,Netherlands,Johan Nijenhuis,"Radek Bajgar, Herman Finkers",Johan Nijenhuis & Co,"Herman Finkers, Johanna ter Steege, Leonie ter...",A middle-aged veterinary surgeon believes his ...,7.7,724,NaN,NaN,$ 7299062,NaN,6.0,4.0
85852,tt9911774,Padmavyuhathile Abhimanyu,Padmavyuhathile Abhimanyu,2019,2019-03-08,130,India,Vineesh Aaradya,"Vineesh Aaradya, Vineesh Aaradya",RMCC Productions,"Anoop Chandran, Indrans, Sona Nair, Simon Brit...",NaN,7.9,265,NaN,NaN,NaN,NaN,NaN,NaN
85853,tt9914286,Sokagin Çocuklari,Sokagin Çocuklari,2019,2019-03-15,98,Turkey,Ahmet Faik Akinci,"Ahmet Faik Akinci, Kasim Uçkan",Gizem Ajans,"Ahmet Faik Akinci, Belma Mamati, Metin Keçeci,...",NaN,6.4,194,NaN,NaN,$ 2833,NaN,NaN,NaN
85854,tt9914942,La vida sense la Sara Amat,La vida sense la Sara Amat,2019,2020-02-05,74,Spain,Laura Jou,"Coral Cruz, Pep Puig",La Xarxa de Comunicació Local,"Maria Morera Colomer, Biel Rossell Pelfort, Is...","Pep, a 13-year-old boy, is in love with a girl...",6.7,102,NaN,NaN,$ 59794,NaN,NaN,2.0